Autodesk.Revit.DB.View.GetModelToProjectionTransforms
Gets the transforms from model space to the view projection space.
Remarks:
Model space is the global 3D coordinate space in which the geometry
of the model lives.
View projection space is the 3D Euclidean space with a coordinate system such that
X and Y are horizontal and vertical directions in the view projection plane and Z
is the cross product of X and Y. Distances in the projection space are the same as
would be measured on paper if the view is printed without additional scaling.
Most views will return just one Autodesk.Revit.DB.TransformWithBoundary.  The exceptions are
views with split crop regions.  Split crop regions can be independently moved and therefore
each region of a split crop gets its own transform and boundary.  You can check if a view has split crop
regions by getting the Autodesk.Revit.DB.ViewCropRegionShapeManager and calling ViewCropRegionShapeManager.IsSplit().
When the view's crop region is split, many TransformWithBoundary objects will be returned.
Each TransformWithBoundary corresponds to one region of the split crop. To determine which
TransformWithBoundary to use when converting a model point into view projection space,
first test to see which split crop region boundary contains the model point.
See TransformWithBoundary.GetBoundary().
Returns:
The transformations from model space to view projection space.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view does not return transforms.
-or-
The view is a perspective view.
Since:
2019.2

Autodesk.Revit.DB.View.HasViewTransforms
Returns true if the view reports model space to view projection space transforms.
Remarks:
Not all views return transforms.  For example, schedules and legends
do not report transforms.
Returns:
True if the view returns transforms, false otherwise.
Since:
2019.2

Autodesk.Revit.DB.View.IsValidViewTemplate(Autodesk.Revit.DB.ElementId)
Verifies that the view represented by templateId can be set as the controlling view template for this view.
templateId:
The id to be validated as a view template for this view.
Returns:
True if the view is valid for us as a view template and compatible with this view, or if it is InvalidElementId, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.ApplyViewTemplateParameters(Autodesk.Revit.DB.View)
Applies to this view the parameters of the input view that are not controlled by the current view template.
Remarks:
Apply the view template parameters is a one-time operation, the association between the views is not preserved.
To get all template parameters call Autodesk.Revit.DB.View.GetTemplateParameterIds on the template.
To get parameters that are not controlled by the template call Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds on the template.
To get current view template of this view use property Autodesk.Revit.DB.View.ViewTemplateId.
otherView:
The view whose parameters are to be applied to this view.
It does not have to be a valid template (property IsTemplate can be true or false).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.SetNonControlledTemplateParameterIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the parameters that will not be included when this view is used as a template.
Remarks:
This should be a subset of the parameters returned by Autodesk.Revit.DB.View.GetTemplateParameterIds (other parameters will be ignored).
newSet:
The parameter ids that should not be marked to be included.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds
Returns a list of parameters that are not marked as included when this view is used as a template.
Remarks:
This is a subset of the parameters returned by Autodesk.Revit.DB.View.GetTemplateParameterIds.
Returns:
The parameter ids that are not marked to be included.
Since:
2013

Autodesk.Revit.DB.View.GetTemplateParameterIds
Returns a list of parameter ids that may be controlled when this view is assigned as a template.
Returns:
The parameter ids that may be controlled.
Since:
2013

Autodesk.Revit.DB.View.GetDirectContext3DHandleOverrides
Returns DirectContext3D handle overrides object for the view.
Returns:
DirectContext3D handle overrides for the view
Since:
2018

Autodesk.Revit.DB.View.GetPointCloudOverrides
Returns point cloud overrides object for the view.
Returns:
Point cloud overrides for the view
Since:
2014

Autodesk.Revit.DB.View.SetViewDisplayModel(Autodesk.Revit.DB.ViewDisplayModel)
Sets the view display model settings for the view.
viewDisplayModel:
View display model settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The silhouette line style id is not a valid line style to apply to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2015

Autodesk.Revit.DB.View.GetViewDisplayModel
Returns the current view display model settings for the view.
Returns:
Current view display model settings.
Since:
2015

Autodesk.Revit.DB.View.SetDepthCueing(Autodesk.Revit.DB.ViewDisplayDepthCueing)
Sets the depth cueing settings for the view.
depthCueing:
Depth cueing settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
-or-
This view cannot use Depth Cueing
Since:
2017

Autodesk.Revit.DB.View.GetDepthCueing
Returns the current depth cueing settings for the view.
Returns:
Current depth cueing settings.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view cannot use Depth Cueing
Since:
2017

Autodesk.Revit.DB.View.SetSketchyLines(Autodesk.Revit.DB.ViewDisplaySketchyLines)
Sets the sketchy lines settings for the view.
sketchyLines:
Sketchy Lines settings to set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2015

Autodesk.Revit.DB.View.GetSketchyLines
Returns the current sketchy lines settings for the view.
Returns:
Current sketchy lines settings.
Since:
2015

Autodesk.Revit.DB.View.SetBackground(Autodesk.Revit.DB.ViewDisplayBackground)
Sets the background for the view.  Background can only be set for 3d views and for Sections/Elevations.
background:
Background to set.  See 'ViewDisplayBackground' class and its 'create' methods.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The background object is invalid, or view has 'Rendering' style.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.GetBackground
Returns the current background set for the view.
Returns:
Current background.
Since:
2014

Autodesk.Revit.DB.View.SetElementOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for an element in the view.
elementId:
Element to override.
overrideGraphicSettings:
An object representing all graphic overrides of the element in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
-or-
Fill pattern must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetElementOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides for an element in the view.
elementId:
The element.
Returns:
An object representing all graphic overrides of the element elementId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId is not a valid Element identifier.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.AreGraphicsOverridesAllowed
Determines if Visibility/Graphics Overriddes can be applied to the view.
Returns:
True if Overriddes can be applied to the view, false otherwise.

Autodesk.Revit.DB.View.IsFilterApplied(Autodesk.Revit.DB.ElementId)
Indicates if a filter is applied to the view.
filterElementId:
ElementId of the filter.
Returns:
True if the filter is applied to the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetFilterVisibility(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets the visibility of the elements associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the specified visibility.
filterElementId:
The ElementId of the filter.
visibility:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterVisibility(Autodesk.Revit.DB.ElementId)
Gets the visibility of the elements associated with a filter.
filterElementId:
The ElementId of the filter.
Returns:
True if the elements associated with the filter are visible in the view, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.RemoveFilter(Autodesk.Revit.DB.ElementId)
Removes a filter from the view.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Filter is not applied to the view.
-or-
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.AddFilter(Autodesk.Revit.DB.ElementId)
Adds a filter to the view.
Remarks:
The filter will be added with default overrides, which means that there will be no change in the view's display.
filterElementId:
ElementId of the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is already applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetFilterOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets the overrides associated with a filter.
Remarks:
If the filter is not currently applied to the view, this will add the filter with the assigned overrides.
filterElementId:
ElementId of the filter.
overrideGraphicSettings:
The overrides to apply to the filter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilterOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides that a filter applies to the view.
filterElementId:
ElementId of the filter.
Returns:
Object representing all graphic overrides of the filter in the view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
ElementId is not associated with a FilterElement.
-or-
Filter is not applied to the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetFilters
Gets the filters applied to the view.
Returns:
The ElementIds of the Filters.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
-or-
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.IsCategoryOverridable(Autodesk.Revit.DB.ElementId)
Checks whether the category can have graphic overrides in this view.
categoryId:
ElementId of the category.
Returns:
True if category can be overridden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.View.GetCategoryOverrides(Autodesk.Revit.DB.ElementId)
Gets graphic overrides for a category in view.
categoryId:
Category to be checked.
Returns:
Object representing all graphic overrides of the category categoryId in view. A default OverrideGraphicSettings object will be returned if it not previously been set for this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.SetCategoryOverrides(Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.OverrideGraphicSettings)
Sets graphic overrides for a category in view.
categoryId:
Category to be overridden
overrideGraphicSettings:
Object representing all graphic overrides of the category categoryId in view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Category cannot be overridden.
-or-
Fill pattern must be a drafting pattern.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The view type does not support Visibility/Graphics Overriddes.
Since:
2014

Autodesk.Revit.DB.View.GetDependentViewIds
Get the ids of dependent views.
Returns:
Ids of the dependent views.
Since:
2013

Autodesk.Revit.DB.View.GetPrimaryViewId
Get the id of the primary view.
Remarks:
The primary view is the view from which a dependent view is created.
Returns:
The id of the primary view, or InvalidElementId if there is no primary view.
Since:
2013

Autodesk.Revit.DB.View.CanModifyViewDiscipline
Indicates if the View Discipline can be modified
Returns:
True if View Discipline can be modified
Since:
2013

Autodesk.Revit.DB.View.HasViewDiscipline
Indicates if the view has a Discipline property
Returns:
True if the view has a Discipline property
Since:
2013

Autodesk.Revit.DB.View.CanUseTemporaryVisibilityModes
Indicates if view can use temporary visibility modes
Returns:
True if view can use temporary visibility modes
Since:
2013

Autodesk.Revit.DB.View.CanUseDepthCueing
Indicates if view can use Depth Cueing
Returns:
True if view can use Depth Cueing
Since:
2017

Autodesk.Revit.DB.View.HasDisplayStyle
Indicates if view has a DisplayStyle property
Returns:
True if view has a DisplayStyle property
Since:
2013

Autodesk.Revit.DB.View.CanModifyDisplayStyle
Indicates if DisplayStyle can be modified.
Returns:
True if DisplayStyle can be modified.
Since:
2013

Autodesk.Revit.DB.View.SupportsRevealConstraints
Checks that the view can have the Reveal Constraints mode activated.
Remarks:
Reveal Constraints mode can only be activated for the following viewtypes:
3D ViewsArea PlansCeiling PlansDetail ViewsDrafting ViewsElevationsFloor PlansSectionsStructural Plans
Returns:
True if the view has a view type that allows Reveal Constraints mode to be activated.
Since:
2016

Autodesk.Revit.DB.View.IsValidViewScale(System.Int32)
This validator checks that the view scale is in the allowable range.
Remarks:
The view scale is expressed as 1/X, where X is an integer the range 1 to 24,000.
viewScale:
The denominator X in the view scale 1/X.
Returns:
True if the view scale is within the allowable range, false otherwise.

Autodesk.Revit.DB.View.AllowsAnalysisDisplay
Identifies if this view allows display of Analysis results.
Returns:
True if the view allows display of Analysis results, false otherwise.
Since:
2015

Autodesk.Revit.DB.View.HasDetailLevel
Check if the view has a Detail Level property
Returns:
True if the view has a Detail Level, false otherwise
Since:
2013

Autodesk.Revit.DB.View.CanModifyDetailLevel
Check if Detail Level can be modified.
Returns:
True if Detail Level can be modified.
Since:
2013

Autodesk.Revit.DB.View.SupportsWorksharingDisplayMode(Autodesk.Revit.DB.WorksharingDisplayMode)
Checks whether this view supports the given worksharing display mode.
Remarks:
For convenience, the "Off" mode is always supported.
Other display modes are supported by graphical views in workshared documents.
mode:
The mode of interest.
Returns:
Returns True if this view is a graphical view in a workshared document or if the desired mode is Off.
Returns False if this view is a non-graphical view (such as a schedule or the project browser)
or if this view is not in a workshared document.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.View.GetWorksharingDisplayMode
Gets the current worksharing display mode for this view.
Remarks:
Returns "Off" if no worksharing display mode is currently enabled.
Returns:
The active worksharing display mode in this view.

Autodesk.Revit.DB.View.SetWorksharingDisplayMode(Autodesk.Revit.DB.WorksharingDisplayMode)
Sets the worksharing display mode for this view.
Remarks:
Turning on a worksharing display mode will disable other temporary view modes such as
reveal hidden elements and temporary hide/isolate.
displayMode:
The desired display mode.  "Off" will turn off all worksharing display modes.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This View does not support the requested worksharing display mode.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.View.IsTemporaryHideIsolateActive
Indicates if the view is temporarily hiding or isolating elements or categories.
Returns:
True if elements/categories are being temporarily hidden or isolated, false otherwise.
Since:
2013

Autodesk.Revit.DB.View.ConvertTemporaryHideIsolateToPermanent
Convert all temporary hidden elements or categories to permanently hidden in view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View does not belong to a project document.
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
This View is an internal element, such as a component of a
loaded family or a group type.
-or-
The document containing this View is in Group Edit Mode,
Sketch Edit Mode, or Paste Mode, and the element is not a
member of the group, sketch, or clipboard.
-or-
This View is a member of a group or sketch, and the document
is not currently editing the group or sketch.
Since:
2013

Autodesk.Revit.DB.View.GetCategoryHidden(Autodesk.Revit.DB.ElementId)
Checks if elements of the given category are set to be invisible (hidden) in this view.
Remarks:
This checks only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
The category classes settings for
model categories, annotation categories, import categories or analytical model categories.  View filters.  Elements hidden individually in the view.
Thus the return value may not reflect the actual visibility of elements of this category in the view.
categoryId:
The ID of the category.
Returns:
True if the category is invisible (hidden), false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.View.SetCategoryHidden(Autodesk.Revit.DB.ElementId,System.Boolean)
Sets if elements of the given category will be visible in this view.
Remarks:
This affects only if the category is set visible or invisible individually.  Other Revit mechanisms
may also affect the visibility of elements of this category, including:
The category classes settings for
model categories, annotation categories, import categories or analytical model categories.  View filters.  Elements hidden individually in the view.
Thus setting this value may not affect the actual visibility of elements of this category in the view.
categoryId:
The ID of the category.
hide:
True to make elements of this category invisible, false to make them visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId does not correspond to a Category.
-or-
Category cannot be hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.View.CanCategoryBeHidden(Autodesk.Revit.DB.ElementId)
Checks whether the category can be hidden in the view.
elementId:
ElementId of the category.
Returns:
True if the category can be hidden, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.View.IsolateCategoriesTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set categories to be temporarily isolated in the view.
elementIds:
Ids of categories to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateCategoryTemporary(Autodesk.Revit.DB.ElementId)
Set one category to be temporarily isolated in the view.
elementId:
Id of category to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily isolated in the view.
elementId:
Id of element to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.IsolateElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily isolated in the view.
elementIds:
Ids of elements to be isolated.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideCategoriesTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple categories to be temporarily hidden in the view.
elementIds:
Ids of the categories to be hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
Some elements in elementIds do not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideCategoryTemporary(Autodesk.Revit.DB.ElementId)
Set one category to be temporarily hidden in the view.
elementId:
Id of the category to be hidden
Throws Autodesk.Revit.Exceptions.ArgumentException:
elementId does not correspond to a Category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.CanCategoryBeHiddenTemporary(Autodesk.Revit.DB.ElementId)
Check if category can be temporarily hidden in the view.
elementId:
Id of the category to be checked
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideElementsTemporary(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Set multiple elements to be temporarily hidden in the view.
elementIdSet:
Ids of the elements to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.HideElementTemporary(Autodesk.Revit.DB.ElementId)
Set one element to be temporarily hidden in the view.
elementId:
The id of the element to be temporarily hidden.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.GetTemporaryViewPropertiesName
When Temporary View Properties mode is in progress, name of applied template is returned.
Outside Temporary View Properties mode, empty string will be returned.
Since:
2014

Autodesk.Revit.DB.View.IsTemporaryViewPropertiesModeEnabled
Returns true when Temporary View Properties mode is in progress, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.GetTemporaryViewPropertiesId
When Temporary View Properties mode is in progress it provides DBView ID that overrode settings for current view.
Outside Temporary View Properties mode InvalidElementId will be returned.
Remarks:
Returned ElementId might refer to element that was deleted.
It will happen when Temporary View Properties mode was applied basing on template that next was deleted.
Since:
2014

Autodesk.Revit.DB.View.EnableTemporaryViewPropertiesMode(Autodesk.Revit.DB.ElementId)
Allow to enable or disable Temporary View Properties mode.
Remarks:
Settings from view provided by viewTemplateId will be applied temporarily to current view.
viewTemplateId:
ID of DBView that will be used to override current view settings.
Provide ElementId.InvalidElementId constant to disable Temporary View Properties mode.
Returns:
Returns true when DBView provided by viewTemplateId was applied and Temporary View Properties was successfully started.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot use Temporary View Properties mode in current state.
Since:
2014

Autodesk.Revit.DB.View.CanEnableTemporaryViewPropertiesMode
Indicates if Temporary View Properties mode can be applied for view in current state.
Returns:
True if view can use Temporary View Properties mode in current state.
Since:
2014

Autodesk.Revit.DB.View.EnableRevealHiddenMode
Enables Reveal Hidden elements mode.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot use temporary visibility modes.
Since:
2013

Autodesk.Revit.DB.View.DisableTemporaryViewMode(Autodesk.Revit.DB.TemporaryViewMode)
Disables the specified temporary view mode.
Remarks:
Has no effect if the mode is already disabled.
mode:
The mode to disable.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot use temporary visibility modes.
Since:
2013

Autodesk.Revit.DB.View.IsInTemporaryViewMode(Autodesk.Revit.DB.TemporaryViewMode)
Returns true if the view is in a particular temporary view mode.
mode:
The mode.
Returns:
True if this view is in the temporary view mode indicated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.View.IsWorksetVisible(Autodesk.Revit.DB.WorksetId)
Indicates whether the workset is visible in this view.
Remarks:
It will take into account whether the workset is opened or closed.
worksetId:
Id of the workset.
Returns:
Whether the workset is visible.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.View.SetWorksetVisibility(Autodesk.Revit.DB.WorksetId,Autodesk.Revit.DB.WorksetVisibility)
Sets visibility for a workset in this view.
Remarks:
It works even when the workset is closed. This settings overrules implicit visibility of the workset (for this particular view only).
worksetId:
Id of the workset.
visible:
The visibility of the workset.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.View.GetWorksetVisibility(Autodesk.Revit.DB.WorksetId)
Returns the visibility settings of a workset for this particular view.
Remarks:
The settings does not reflect the fact of whether a workset is currently closed or not.
worksetId:
Id of the workset.
Returns:
The visibility of a workset for this particular view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
There is no workset with this Id in the document associated with this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.View.IsElementVisibleInTemporaryViewMode(Autodesk.Revit.DB.TemporaryViewMode,Autodesk.Revit.DB.ElementId)
Identifies if the input element is visible for the temporary view mode for this view.
mode:
The temporary view mode.  Only TemporaryHideIsolate and AnalyticalModel modes are supported
by this option.  Other modes will result in an exception.
id:
The element id.
Returns:
True if the element is visible, false if the element is hidden in the view mode.
Throws Autodesk.Revit.Exceptions.ArgumentException:
This view mode is not supported for checking element visibility.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2012

Autodesk.Revit.DB.View.CanViewBeDuplicated(Autodesk.Revit.DB.ViewDuplicateOption)
Identifies if this view can be duplicated.
duplicateOption:
The option to use when duplicating the view.
Returns:
True if the view can be duplicated, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.View.ConvertToIndependent
Convert the dependent view to independent.
Remarks:
This method can be only applied to a dependent view.
A dependent view can be created from another view using method View.Duplicate(ViewDuplicateOption.AsDependent).
Dependent views have a valid primary view element ID that can be obtained via method View.GetPrimaryViewId();
Independent views have InvalidElementId as their primary view ID.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This view is not dependent.
Since:
2016

Autodesk.Revit.DB.View.Duplicate(Autodesk.Revit.DB.ViewDuplicateOption)
Duplicates this view.
duplicateOption:
The option to use when duplicating the view.
Returns:
The id of the newly created view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View cannot be duplicated
Since:
2013

Autodesk.Revit.DB.View.GetReferenceElevations
Returns element ids of all reference elevations in the view.
Returns:
Element ids of all reference elevations in the view.
Since:
2014

Autodesk.Revit.DB.View.GetReferenceSections
Returns element ids of all reference sections in the view.
Returns:
Element ids of all reference sections in the view.
Since:
2014

Autodesk.Revit.DB.View.GetReferenceCallouts
Returns element ids of all reference callouts in the view.
Returns:
Element ids of all reference callouts in the view.
Since:
2014

Autodesk.Revit.DB.View.GetCropRegionShapeManagerForReferenceCallout(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Returns an object for managing view crop region shape for reference callout.
Remarks:
Reference callout is a view-specific element referencing another view.
It can have its own crop region shape which doesn't affect the referenced view.
doc:
Document to which the callout belongs.
callout:
Element id of reference callout.
Returns:
The crop region shape manager.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.View.GetCropRegionShapeManager
Returns an object for managing view crop region shape.
Returns:
The crop region shape manager.
Since:
2014

Autodesk.Revit.DB.View.ViewTemplateId
The id of the template view that controls this view's parameters.
Remarks:
Parameters controlled by the template cannot be changed directly in this view.
Any change to controlled parameters in the template will cause change of the corresponding parameters in this view.
Use Autodesk.Revit.DB.View.GetTemplateParameterIds on the template view to get a list of all template parameters.
Use Autodesk.Revit.DB.View.GetNonControlledTemplateParameterIds on the template view to get parameters that are not controlled by the template.
The id of the template view that controls this view's parameters. InvalidElementId if there is no template set for this view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: val is not valid as a view template id for this view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.View.SunlightIntensity
The intensity of the simulated (directional) sunlight.  0 = no directional light; maximum value is 100.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is invalid. The valid range is 0 through 100
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.ShadowIntensity
The intesity of cast shadows - 0 = no shadows, 100 = black.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: The value is invalid. The valid range is 0 through 100
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This view does not contain display-related properties.
Since:
2014

Autodesk.Revit.DB.View.Discipline
The Discipline of the view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
View must have a Discipline property
-or-
When setting this property: View Discipline must be modifiable.
Since:
2013

Autodesk.Revit.DB.View.DisplayStyle
The DisplayStyle of the view.
Returns DisplayStyle.Wireframe if the view has no display style.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: DisplayStyle cannot be set to Raytrace.
Because setting a view's display style to raytrace enters a special restricted mode with limited capabilities,
it is not permitted to directly assign the display style to this value.
-or-
When setting this property: DisplayStyle cannot be set to Undefined.
-or-
When setting this property: DisplayStyle of Drafting Views can be set only to Wireframe or HLR
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: DisplayStyle cannot be modified.
-or-
When setting this property: This view does not contain display-related properties.
Since:
2013

Autodesk.Revit.DB.View.RevealConstraintsMode
Indicates whether the Reveal Constraints mode is activated in the view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: View has a view type that does not allow Reveal Constraints mode to be activated.
Since:
2016

Autodesk.Revit.DB.View.TemporaryViewModes
Data of temporary view modes associated with this view.
Remarks:
Temporary view modes are available in graphic views only.
Since:
2016 Subscription Update

Autodesk.Revit.DB.View.AnalysisDisplayStyleId
Element id of Analysis Display Style associated with the view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: Cannot set the AnalysisDisplayStyleId for the specified view.
Since:
2011

Autodesk.Revit.DB.View.AreCoordinationModelHandlesHidden
Indicates if Coordination Model handles are currently hidden in the view.
True if Coordination Model handles are currently hidden in the view, false otherwise.
Since:
2018

Autodesk.Revit.DB.View.ArePointCloudsHidden
Indicates if point clouds are currently hidden in the view.
True if point clouds are currently hidden in the view, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.AreImportCategoriesHidden
Indicates if import categories are currently hidden in the view.
True if import categories are currently hidden in the view, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.AreAnalyticalModelCategoriesHidden
Indicates if analytical model categories are currently hidden in the view.
True if analytical model categories are currently hidden in the view, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.AreAnnotationCategoriesHidden
Indicates if annotation categories are currently hidden in the view.
True if annotation categories are currently hidden in the view, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.AreModelCategoriesHidden
Indicates if model categories are currently hidden in the view.
True if model categories are currently hidden in the view, false otherwise.
Since:
2014

Autodesk.Revit.DB.View.DetailLevel
The detail level of this view.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: Cannot set ViewDetailLevel to Unassigned
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: View does not have a Detail Level property
-or-
When setting this property: Detail Level cannot be modified.
Since:
2013

Autodesk.Revit.DB.View.PartsVisibility
The visibility setting for parts in this view.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.View.Title
The view title. This consists of the view name plus other modifiers, such as the view type,
sheet number, area scheme, and/or assembly type, depending on the specifics of the view.
Since:
2015

Autodesk.Revit.DB.View.IsAssemblyView
Indicates if the view is assembly view.
Since:
2015

Autodesk.Revit.DB.View.AssociatedAssemblyInstanceId
The Id of the assembly instance that owns the assembly view.

Autodesk.Revit.DB.View.HideActiveWorkPlane
Hide the active work plane of the view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.
Since: 2011

Autodesk.Revit.DB.View.ShowActiveWorkPlane
Show the active work plane of the view.
Remarks: If this method is invoked while the current work plane is hidden, only the outline of the updated work plane will be shown immediately.
The updated sketch plane will be shown fully after the current transaction is committed. Therefore it is recommended the Add-On commits the transaction
before performing UI operations (for example, PickPoint).
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility.
Since: 2011

Autodesk.Revit.DB.View.SunAndShadowSettings
The sun and shadow settings assigned to the view for shadow calculation and rendering.
The sun and shadow settings, or null for views which don't allow this (such as schedules).
Since: 2011

Autodesk.Revit.DB.View.SketchPlane
The sketch plane assigned to the view for model curve creation.
The sketch plane, or null for views which don't allow sketching (such as schedules) or
for views that allow model curve creation but have no current sketch plane assigned.
Remarks: If this property is set in when the current work plane is visible, the updated work plane will not be shown until the current
transaction is committed. Therefore it is recommended the Add-On commits the transaction before performing UI operations (for example, PickPoint).
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when setting the property to null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when setting the property to a sketch plane that cannot be used to create model elements,
or when the input sketch plane is orthogonal to the view orientation.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting the property to a view that does not permit model curve creation, or when other errors occur.

Autodesk.Revit.DB.View.UnhideElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements to be shown in the given view if they are currently hidden.
elementIdSet: A set of ElementIds to be unhidden.
Remarks: This change is permanent until the elements are hidden again.
All elements in the set must be currently hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View).
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be unhidden is empty or one of the elements can not be unhidden.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.

Autodesk.Revit.DB.View.HideElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the elements to be hidden in the view.
elementIdSet: A set of ElementIds to be hidden.
Remarks: This change is permanent until the elements are unhidden.
All elements in the set must be currently unhidden and must be allowed to be hidden.
An application can check this with Autodesk.Revit.DB.Element.IsHidden(Autodesk.Revit.DB.View) and Autodesk.Revit.DB.Element.CanBeHidden(Autodesk.Revit.DB.View).
Some elements cannot be hidden directly. Examples include: group, array, constraint, edit cut profile, face splitter and link to external documents.
Throws Autodesk.Revit.Exceptions.ArgumentNullException: Thrown when argument is null.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown when the set of elements to be hidden is empty or one of the elements can not be hidden.
Also thrown when the set of elements to be hidden includes the view itself.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when document regeneration failed.

Autodesk.Revit.DB.View.CropBoxVisible
Whether or not the Crop Box/Region is visible for the view.
Throws Autodesk.Revit.Exceptions.InapplicableDataException: Thrown when getting this property,
if the view is a template and cannot have a crop box applied.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting this property,
if the view is a template and cannot have a crop box applied.

Autodesk.Revit.DB.View.CropBoxActive
Whether or not the Crop Box/Region is active for the view.
Remarks: Identifies whether the crop region modifies the graphical appearance of
elements in the view.
Throws Autodesk.Revit.Exceptions.InapplicableDataException: Thrown when getting this property,
if the view is a template and cannot have a crop box applied.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when setting this property,
if the view is a template and cannot have a crop box applied.

Autodesk.Revit.DB.View.GenLevel
The level for the view.
Remarks: This will obtain the level for views related to levels, such as Plan Views.
If this View is not generated by a level, this property is null.

Autodesk.Revit.DB.View.Print(Autodesk.Revit.DB.View)
Print this view with the given view template and using the print setting of the current active document.
viewTemplate: The view template which apply to the view.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the view cannot be printed.

Autodesk.Revit.DB.View.Print
Print this view with the default view template and using the print setting of the current active document.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the view cannot be printed.

Autodesk.Revit.DB.View.Print(Autodesk.Revit.DB.View,System.Boolean)
Print this view with the given view template, and either the view's document's print setting or the print setting of the current active document.
viewTemplate: The view template which apply to the view.
useCurrentPrintSettings: If true, print the view with the print setting of the current active document;
otherwise with the view's document's print setting.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the view cannot be printed.

Autodesk.Revit.DB.View.Print(System.Boolean)
Print this view.
Print this view with the default view template, and either the view's document's print setting or the print setting of the current active document.
useCurrentPrintSettings: If true, print the view with the print setting of the current active document;
otherwise with the view's document's print setting.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Thrown when the view cannot be printed.

Autodesk.Revit.DB.View.IsTemplate
Test whether the view is a view template.
Since: 2011

Autodesk.Revit.DB.View.CanBePrinted
Test whether the view can be printed.

Autodesk.Revit.DB.View.UpDirection
The direction towards the top of the screen.

Autodesk.Revit.DB.View.RightDirection
The direction towards the right side of the screen.

Autodesk.Revit.DB.View.ViewDirection
The direction towards the viewer.
Remarks: In orthographic views, all objects are projected onto the screen along
this direction. In perspective views, the view target point is projected along
this direction, but other points are projected towards the eye along different
vectors.

Autodesk.Revit.DB.View.Scale
The scale of the view.
Remarks: The scale is the ratio of true model size to paper size.
This property is meaningless for perspective views.  When setting the scale if the
scale corresponds to a predefined scale, the predefined item will be applied.  Otherwise,
a custom scale will be applied.

Autodesk.Revit.DB.View.Origin
Returns the origin of the screen.
Remarks: The origin of a plan view is not meaningful.
null if the view is a template.

Autodesk.Revit.DB.View.CropBox
The Crop Box applied to the view, or an outline encompassing the crop region applied to the view.
Remarks: The X direction of the box is right on screen; Y is up; and Z is towards the user. The crop box Z value of a plan view is not meaningful.
Remarks: The effect of setting the crop box of a view is to modify the crop region and far clip plane to the smallest values which will completely contain the
3D box specified by the source. Neither the cut plane nor the view frame are affected by setting the crop box.
Remarks: Note: the Transform of the input BoundingBoxXYZ is ignored. Only Max and Min members of the input BoundingBoxXYZ are used.
null if the view is a template, or does not support cropping.  If the view has a non-rectangular crop region, defined by
a sketch, the crop box will be the smallest box that contains the sketch.  Setting the crop box for a view with a non-rectangular crop region will
have no effect. For better access to the crop region of a given view, regardless of the shape of the crop region, use the return from Autodesk.Revit.DB.View.GetCropRegionShapeManager.
Throws Autodesk.Revit.Exceptions.InvalidOperationException: Cannot set the CropBox of the specified view.

Autodesk.Revit.DB.View.ViewType
The type of the view.

Autodesk.Revit.DB.View.ViewName
The name of the view.
Throws Autodesk.Revit.Exceptions.ArgumentException: Thrown if the name provided already exists, or is invalid for this view.

Autodesk.Revit.DB.View.Outline
The bounds of the view in paper space (in feet).
Remarks: Returns all zeros for empty views.

Autodesk.Revit.DB.View
Base class for all types of views in Autodesk Revit.
Remarks:
A view can display an image produced from a Revit model.
Views can be graphical (e.g. plans, elevations, or 3D views)
or textual (e.g. schedules). Views keep track of Elements that can be seen in them.